app/views/comments/create.js.erb

INSERT INTO "comments" ("author", "content", "created_at", "entry_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Author 2"], ["content", "Comment 2"], ["created_at", Mon, 24 Jun 2013 03:33:14 UTC +00:00], ["entry_id", 2], ["updated_at", Mon, 24 Jun 2013 03:33:14 UTC +00:00]]
---
var new_comment = $("<li><i><%= @comment.author %></i>, at <i><%= @comment.created_at %></i>: \"<%= @comment.content %>\"</li>");