app/views/entries/_form.html.erb

	<% @categories.each do |category| %>
		<%= check_box_tag "entry[category_ids][]", category.id, @entry.categories.include?(category), id: dom_id(category) %>
---
SELECT "categories".* FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."entry_id" = 3
SELECT 1 AS one FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."entry_id" IS NULL AND "categories"."id" = 1 LIMIT 1