app/views/entries/new_comment.js.erb

INSERT INTO "comments" ("author", "content", "created_at", "entry_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Author 1"], ["content", "Comment 1"], ["created_at", Mon, 24 Jun 2013 02:28:46 UTC +00:00], ["entry_id", 1], ["updated_at", Mon, 24 Jun 2013 02:28:46 UTC +00:00]]
---
var new_comment = $("<li><i><%= @comment.author %></i>, at <i><%= @comment.created_at %></i>: \"<%= @comment.content %>\"</li>");