app/views/entries/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."entry_id" = 3
SELECT COUNT(*) FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."entry_id" = 3
---
	<b>Categories:</b>
<% unless @entry.categories.any? %>