app/controllers/categories_controller.rb

	def index
		@categories = Category.all
---
SELECT "categories"."id" FROM "categories"

	def show
		@category = Category.includes(:entries).find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "entries".* FROM "entries" INNER JOIN "categorizations" ON "entries"."id" = "categorizations"."entry_id" WHERE "categorizations"."category_id" = 1

	def create
		@category = Category.new(params[:category])

		respond_to do |format|
			if @category.save
---
INSERT INTO "categories" ("description", "name") VALUES (?, ?)  [["description", "Category 1"], ["name", "category_1"]]

	def update
		@category = Category.find(params[:id])

		respond_to do |format|
			if @category.update_attributes(params[:category])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "categories" SET "name" = 'Category 2', "description" = 'Description 2' WHERE "categories"."id" = 2