app/controllers/comments_controller.rb

	def index
		@entry = Entry.find(params[:entry_id])
		@comment_ids = @entry.comments.collect { |comment| comment.id }
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."entry_id" = 1

	def create
		@entry = Entry.find(params[:entry_id])
		@comment = Comment.new(params[:comment])
		@entry.comments << @comment
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "comments" ("author", "content", "created_at", "entry_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Author 2"], ["content", "Comment 2"], ["created_at", Mon, 24 Jun 2013 03:33:14 UTC +00:00], ["entry_id", 2], ["updated_at", Mon, 24 Jun 2013 03:33:14 UTC +00:00]]

	def show
		@entry = Entry.find(params[:entry_id])
		@comment = @entry.comments.find(params[:id])
---
SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."entry_id" = 1 AND "comments"."id" = ? LIMIT 1  [["id", "2"]]