app/controllers/entries_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."entry_id" IN (1, 2, 3)
SELECT "entries"."id" FROM "entries"
---
	def index
		@entries = Entry.includes(:comments).all

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "comments" ("author", "content", "created_at", "entry_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "Author 1"], ["content", "Comment 1"], ["created_at", Mon, 24 Jun 2013 02:28:46 UTC +00:00], ["entry_id", 1], ["updated_at", Mon, 24 Jun 2013 02:28:46 UTC +00:00]]
---
	def new_comment
		@entry = Entry.find(params[:id])
		@comment = Comment.new(params[:comment])
		@entry.comments << @comment

SELECT "categories".* FROM "categories"
---
	def new
		@entry = Entry.new
		@categories = Category.all

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "categories".* FROM "categories"
---
	def edit
		@entry = Entry.find(params[:id])
		@categories = Category.all

INSERT INTO "entries" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Content 1"], ["created_at", Mon, 24 Jun 2013 02:28:32 UTC +00:00], ["title", "Entry 1"], ["updated_at", Mon, 24 Jun 2013 02:28:32 UTC +00:00]]
---
	def create
		@entry = Entry.new(params[:entry])

		respond_to do |format|
			if @entry.save

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
---
	def update
		@entry = Entry.find(params[:id])

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 1]]
---
	def destroy
		@entry = Entry.find(params[:id])
		@entry.destroy