app/controllers/entries_controller.rb

	def index
		@entries = Entry.includes(:comments).all

		if params[:category_id]
			@category = Category.find(params[:category_id])
			@entry_ids = @category.entries.collect { |entry| entry.id }
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "categories".* FROM "categories" INNER JOIN "categorizations" ON "categories"."id" = "categorizations"."category_id" WHERE "categorizations"."entry_id" = 3
SELECT "entries".* FROM "entries" INNER JOIN "categorizations" ON "entries"."id" = "categorizations"."entry_id" WHERE "categorizations"."category_id" = 2