app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest") VALUES (?, ?)  [["email", "trantuananh@2359media.com.vn"], ["password_digest", "$2a$10$6pwvIv0rZhdXpRPxUx0.uOjSt9Nc6naxFc8eYyIxQipBKdkOPPnVG"]]
---
	def create
		@user = User.new(params[:user])
		if @user.save