app/views/categories/show.html.erb

SELECT "entries".* FROM "entries" INNER JOIN "categorizations" ON "entries"."id" = "categorizations"."entry_id" WHERE "categorizations"."category_id" = 1
SELECT COUNT(*) FROM "entries" INNER JOIN "categorizations" ON "entries"."id" = "categorizations"."entry_id" WHERE "categorizations"."category_id" = 1
---
	<b>Entries:</b>
<% unless @category.entries.any? %>